#include "st_crc.h"
#include "main.h"

CRC_HandleTypeDef hcrc;

/*==================================================================================
* 函 数 名： st_crc_init
* 参    数： None
* 功能描述:  st crc初始化
* 返 回 值： none
* 备    注： 
* 作    者： xiaozh
* 创建时间： 2019-09-10 182605
==================================================================================*/ 
void st_crc_init(void)
{
	__HAL_RCC_CRC_CLK_ENABLE();	
	hcrc.Instance = CRC;
  HAL_CRC_Init(&hcrc);
}

/*==================================================================================
* 函 数 名： st_crc32
* 参    数： None
* 功能描述:  st crc校验
* 返 回 值： none
* 备    注： 
* 作    者： xiaozh
* 创建时间： 2019-10-16 162442
==================================================================================*/ 
uint32_t st_crc32(uint8_t *buff, uint16_t len)
{ 
	//复位
//	CRC->CR = CRC_CR_RESET;
	
	for(int i=0; i<len; i++)
	{
		CRC->DR = buff[i];
	} 
	
	return (CRC->DR);
}
 

/*==================================================================================
* 函 数 名： st_crc32
* 参    数： None
* 功能描述:  st crc校验
* 返 回 值： none
* 备    注： 
* 作    者： xiaozh
* 创建时间： 2019-10-16 162442
==================================================================================*/ 
void st_crc32_reset(void)
{ 
	//复位
	CRC->CR = CRC_CR_RESET; 
}
